using UnityEngine;
using System.Collections;
using System.Text;

namespace AL
{
    public static class RandomName
    {
        public static string GetName(bool male)
        {
            //return "粑粑教你做人";
            string[] surNameArr = { "腼腆的", "机灵的", "英勇的", "可爱的", "阳光的", "开朗的", "活泼的", "无敌的", "伟大的", "高贵的", "温柔的", "善良的", "乐观的", "机智的", "美丽的", "傲娇的", "中二的", "单纯的", "俊俏的", "大方的", "纯洁的", "优雅的", "淳朴的", "清秀的", "稚气的", "俏皮的", "干脆的", "爽直的", "憨直的", "耿直的", "公道的", "公允的", "正派的", "简捷的", "开阔的", "明朗的", "率直的", "率真的", "理智的", "老实的", "坚强的", "萌萌的", "温和的", "负责的", "正直的", "无私的", "友好的", "直爽的", "热情的", "好动的", "幽默的", "风趣的", "高冷的", "逗比的", "体贴的", "积极的", "自信的", "深沉的", "知足的", "浪漫的", "快乐的", "灵巧的", "捣蛋的", "大胆的", "能干的", "踏实的", "稳健的", "成熟的", "谦卑的", "谦虚的", "勇敢的", "老练的", "可靠的", "果敢的", "精悍的", "调皮的", "古怪的", "勤劳的", "恭顺的", "诚实的", "公正的", "聪慧的", "笃实的", "温厚的", "赤诚的", "竭诚的", "恳挚的", "赤忱的", "衷心的", "坦率的", "规矩的", "热诚的", "虔诚的", "尽职的", "和善的", "过谦的", "客气的", "和婉的", "好客的", "安静的", "沉默的", "静谧的", "勤奋的" };
            string[] maleNameArr = { "亚伦", "亚伦", "艾伦", "埃布尔", "亚尔维斯", "亚托克斯", "巴伦", "班森", "布鲁斯", "伯特", "布兰茨", "科林", "克里斯", "采尼", "卡尔", "科加斯", "丹尼尔", "德里克", "唐纳德", "大卫", "蒙多", "爱德华", "艾德文", "埃里克", "埃尔斯特", "伊泽瑞尔", "佛朗西斯", "佛兰德", "弗兰克", "富兰克林", "费德提克", "加比", "加百利", "基诺", "格林", "普朗克", "哈里森", "汉克", "雨果", "霍德华", "黑默丁格", "伊恩", "英格玛", "艾萨克", "伊西多", "贾斯汀", "约瑟夫", "吉米", "杰罗姆", "嘉文", "肯", "凯文", "肯尼", "肯尼", "卡尔萨斯", "雷欧", "里奥波特", "劳瑞", "卢克", "卢锡安", "马克", "马修斯", "麦克", "迈克尔", "玛尔扎哈", "尼尔", "尼古拉斯", "诺尔", "诺曼", "诺提勒斯", "欧格登", "奥利佛", "奥玛", "奥斯卡", "奥拉夫", "佩吉", "派克", "保罗", "皮特", "潘森", "昆特", "昆西", "昆", "昆顿", "奎因", "雷尔夫", "雷切尔", "里根", "罗宾", "兰博", "山姆", "肖恩", "所罗门", "史丹佛", "斯卡纳", "泰勒", "提姆", "汤尼", "杜鲁门", "塔里克", "尤多", "尤利西斯", "阿普顿", "尤莱亚", "乌迪尔", "范拉丁", "维克", "维多特", "文森", "维迦", "韦德", "瓦尔特", "韦恩", "温德尔", "沃里克", "塞维尔", "莱昂纳多", "塞西尔", "莱斯特", "泽拉斯", "耶鲁", "耶尔希", "约克", "伊夫", "约里克", "扎克", "扎卡莱", "纪伯伦", "苏洛", "吉格斯" };
            string[] femaleNameArr = { "艾莉丝", "艾莉丝", "阿曼达", "艾米", "安琪拉", "阿卡丽", "芭芭拉", "贝拉", "柏莎", "贝丝", "卡萝", "凯丝", "塞西莉亚", "坎蒂丝", "凯特琳", "达莲娜", "黛比", "黛娜", "狄德丽", "黛安娜", "爱琳", "伊甸", "伊迪丝", "艾西", "伊芙琳", "梵妮", "法兰西斯", "佛莉达", "费怡", "菲奥娜", "姬玛", "珍妮芙", "姬儿", "格莱蒂斯", "赫达", "海伦", "希尔达", "何蒙莎", "艾娜", "艾尔玛", "艾薇", "伊莎贝尔", "婕咪", "乔安娜", "珍妮", "杰西卡", "迦娜", "卡玛", "凯伊", "凯蒂", "克莉丝汀", "卡特琳娜", "莉拉", "丽娜", "莉莉丝", "莉莲", "乐芙兰", "美乐蒂", "玛琪", "玛乔丽", "美莲丝", "莫甘娜", "妮可", "妮狄娅", "妮娜", "诺维雅", "奈德丽", "奥利维亚", "奥利芙", "奥利薇兰", "奥克薇儿", "奥莉安娜", "蓓姬", "潘妮", "潘朵拉", "普力玛", "波比", "昆娜", "昆蒂娜", "克拉", "克尔莱", "奎因", "丽贝卡", "蕾佳娜", "丽达", "莉娃", "瑞雯", "雪莉", "莎拉", "赛拉", "雪伦", "希瓦娜", "泰丽莎", "托比", "翠西", "尤娜", "崔丝塔娜", "优娜", "优拉", "尤瑞娅", "乌兰妮", "维纳斯", "维多利亚", "维琪", "维尔拉", "薇恩", "温蒂", "温妮", "旺妲", "华莉丝", "桑席", "赛薇亚拉", "芝妮雅", "席娜", "耶达", "依耶塔", "依耶芙特", "伊芳", "若伊", "若娜", "若拉", "丽诺比丽", "婕拉" };

            StringBuilder sb = new StringBuilder();

            sb.Append(surNameArr[Random.Range(0, surNameArr.Length - 1)]);
            if (male)
            {
                sb.Append(maleNameArr[Random.Range(0, maleNameArr.Length - 1)]);
            }
            else
            {
                sb.Append(femaleNameArr[Random.Range(0, femaleNameArr.Length - 1)]);
            }
            return sb.ToString();
        }

        public static string GetName()
        {
            return GetName(Random.value == 1);
        }
    }
}
